{
  "sources": [
    {
      "title": "Technoskald's Forge",
      "feedUrl": "https://technoskald.me/feed/",
      "siteUrl": "https://technoskald.me",
      "articles": [
        {
          "id": "http://technoskald.me/?p=6397",
          "author": "Kyle Maxwell",
          "description": "A quick set of thoughts on naming, focused on NSR and FKR and other abbreviations.",
          "link": "https://technoskald.me/2022/05/04/nsr-fkr-apt-xyz/",
          "publishedOn": "2022-05-04T17:58:10.000Z",
          "wordCount": 822,
          "title": "NSR, FKR, APT, XYZ…",
          "imageUrl": "https://skaldforge.files.wordpress.com/2022/05/kriegsspiel_1824.jpg"
        },
        {
          "id": "http://technoskald.me/?p=6378",
          "author": "Kyle Maxwell",
          "description": "What makes Into the Odd (and, by extension, Electric Bastionland) so great? Here are a few reasons.",
          "link": "https://technoskald.me/2022/04/11/why-i-like-into-the-odd/",
          "publishedOn": "2022-04-12T00:17:49.000Z",
          "wordCount": 833,
          "title": "Why I like Into the Odd",
          "imageUrl": "https://skaldforge.files.wordpress.com/2022/04/bolonchen.jpg"
        },
        {
          "id": "http://technoskald.me/?p=6365",
          "author": "Kyle Maxwell",
          "description": "The crew takes shore leave on Station 472 and considers changes to their future business plans. Also, bricks of human flesh.",
          "link": "https://technoskald.me/2022/04/09/janus-mothership-campaign-session-6/",
          "publishedOn": "2022-04-09T22:15:21.000Z",
          "wordCount": 1047,
          "title": "“Janus” Mothership Campaign – Session 6",
          "imageUrl": "https://skaldforge.files.wordpress.com/2022/04/brick.webp"
        }
      ]
    },
    {
      "title": "Tabletop Curiosity Cabinet",
      "feedUrl": "https://tabletopcuriositycabinet.blogspot.com/feeds/posts/default",
      "siteUrl": "https://tabletopcuriositycabinet.blogspot.com/",
      "articles": [
        {
          "id": "https://tabletopcuriositycabinet.blogspot.com/2022/04/worldbuilding-without-canon.html",
          "author": null,
          "description": "\"There is no canon.\"\nThis, I feel, is the best way to deal with worldbuilding in tRPGs. Rather than fight against the given fact that people will alter your work based on the preferences and needs of their tables, you can learn to embrace it and actively make settings that do not have a canon, or at least very little canon. There are a number of ways I have seen folks embrace this idea: from sharing unfinished projects and incomplete thoughts to publishing material that deliberately leaves gaps that need to be filled in during prep or at the table. \n\nLuka Rejec is the one I found that first called this sort of writing anti-canon, but Chris McDowall makes references to similar thoughts (and I consider Electric Bastionland to be the pinacle of this sort of anti-canon worldbuilding), and Arno…",
          "link": "https://tabletopcuriositycabinet.blogspot.com/2022/04/worldbuilding-without-canon.html",
          "publishedOn": "2022-04-28T12:02:00.002Z",
          "wordCount": 3035,
          "title": "Worldbuilding without canon",
          "imageUrl": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EyuwGk3yDElxGa4hBnJVB9mKYLIFc1fUvNDHSmFVjFo4jyI0sa3IyKG2w7eYaxinyVlgx1iFjwZLEiqkRsCPjD6taQbkH5EQjNZwN4nTOsZVjRTfVOrnnM=w1200-h630-p-k-no-nu"
        },
        {
          "id": "https://tabletopcuriositycabinet.blogspot.com/2022/04/how-i-run-complete-adventures-in-under.html",
          "author": null,
          "description": "Intro: Not enough time\n\nAlmost every day I am confronted with an annoying fact: I have more interests than I have time for. Add a job and a relationship to this and I have not nearly enough time to do all the things that interest me. In short: there is little time for me to run and prep tRPGs. \n\nThis has made me obsessed with efficiency, both when running games as well as when I design tRPG stuff. On the design end of things, Chris McDowall's minimalism has been really influential in this and his work is something I consider the gold standard to aim for myself. But it turns out that when running games I am already quite efficient with my time.\n\nThrough surveying my players for the FLOK playtest I learned that all of them seemed in agreement that I run my games fast. To give an example: I r…",
          "link": "https://tabletopcuriositycabinet.blogspot.com/2022/04/how-i-run-complete-adventures-in-under.html",
          "publishedOn": "2022-04-25T09:28:00.001Z",
          "wordCount": 3301,
          "title": "How I run: complete adventures in under 90 minutes",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEit6qZWnCBSssg33o08MzdRUG9sHiS7GDKTvbfr6DQAmwZ5iXBs8tafmwR6I7-hs2xDQXCS0GW13Z549m2jYFgQ9bTswixKJs5omlKiPreOVKhGTRPcg0ucz_z0g98A4YX92UilglQACHsGPpiI2tOShSVdp8m_2-B-oHiLB1VDDYHgDF3TDXjfGYzP/w1200-h630-p-k-no-nu/Archer_Blog.jpg"
        }
      ]
    },
    {
      "title": "Substitute Adventurer",
      "feedUrl": "https://substituteadventurer.blogspot.com/feeds/posts/default",
      "siteUrl": "https://substituteadventurer.blogspot.com/",
      "articles": []
    },
    {
      "title": "eskur.dev",
      "feedUrl": "https://eskur.dev/index.xml",
      "siteUrl": "https://eskur.dev/",
      "articles": [
        {
          "id": "https://eskur.dev/posts/blades-a-oneshot-framework/",
          "author": null,
          "description": "A detailed guide for how I run one-shots of Blades In The Dark",
          "link": "https://eskur.dev/posts/blades-a-oneshot-framework/",
          "publishedOn": "2022-04-13T00:00:00.000Z",
          "wordCount": 2326,
          "title": "Blades in the Dark: A One-Shot Framework",
          "imageUrl": "https://eskur.dev/images/ogimage.png"
        }
      ]
    },
    {
      "title": "Hopeful Weird Wonder",
      "feedUrl": "https://hopefulweirdwonder.blogspot.com/feeds/posts/default",
      "siteUrl": "https://hopefulweirdwonder.blogspot.com/",
      "articles": []
    },
    {
      "title": "Session Zero",
      "feedUrl": "https://blog.symbolic.city/feed/",
      "siteUrl": "https://blog.symbolic.city/",
      "articles": []
    },
    {
      "title": "Cige Engine",
      "feedUrl": "https://cigeengine.blogspot.com/feeds/posts/default",
      "siteUrl": "https://cigeengine.blogspot.com/",
      "articles": []
    },
    {
      "title": "A Knight at the Opera",
      "feedUrl": "https://knightattheopera.blogspot.com/feeds/posts/default",
      "siteUrl": "https://knightattheopera.blogspot.com/",
      "articles": [
        {
          "id": "https://knightattheopera.blogspot.com/2022/05/hidden-grove-of-deep-druids-adventure-i.html",
          "author": null,
          "description": "Longtime reader Harald Maassen just released a really tight dungeon adventure called \"Hidden Grove of the Deep Druids,\" which I contributed artwork for!\n\nIt's available as a Pay What You Want download on the Dungeon Master's Guild. Worry not though. It's a decently system-flexible adventure good for all medieval-ish fantasy dungeoncrawlers. If you are 5E player, it provides some lite mechanical support to run the adventure in a more old-school way.\n\n\nThe premise? \"Evil druid cult.\" An ever-elusive archetype but one that I think Harald has nailed here. If you've never used druids as villains, you should really give it a whirl.\n\n\nIt's a medium-sized dungeon that's non-linear, has lots and lots of dangers (especially weird fungi), and has clean and helpful formatting. It'll make a fine addition to anyone's collection of solid, vanilla-yet-tasty dungeons to slot into their game.",
          "link": "https://knightattheopera.blogspot.com/2022/05/hidden-grove-of-deep-druids-adventure-i.html",
          "publishedOn": "2022-05-03T07:04:00.003Z",
          "wordCount": 681,
          "title": "Hidden Grove of the Deep Druids: an adventure I drew for",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEil7wyTLB6z_hqUCv9j15FM1hbRvXIDfB-rN40cTvsgvOkBlZD-ClNW7u8-l8REuFfpU_pL8bQywUCn9Wzq_xVZTt4_lwi8AOg2KIXy8vB5lqPy0t-cXSesNyOV70owKWsihTwf10kpU7sZl1KlJcwqZaDja1E4v6JywhqwoJVPnpogpSsvBeqsnsTf/w1200-h630-p-k-no-nu/Cover%20Third%20Edit.jpg"
        },
        {
          "id": "https://knightattheopera.blogspot.com/2022/04/potpourri.html",
          "author": null,
          "description": "Artist Credit: Kieran Yanner\n\nMy blog output has been slow this year. Partially this is because I've started several very long posts that are each taking a while to finish, but mostly it's because I spend most of my time working now and have very little time left each day to do anything. I wanted to come up with something a bit smaller that could work as a good blog post to get out before the end of the month that isn't one of those huge posts, but I struggled. Everything I came up with was too small. So why not just offer all of them at once?\nIn this post you'll find seven really small RPG-related things I'd like to share which are all completely unrelated to one another. I hope the comments are chaos. They include:\n\n\nAn idea I had for a particular take on the \"Grit vs Flesh\" mechanic\nA w…",
          "link": "https://knightattheopera.blogspot.com/2022/04/potpourri.html",
          "publishedOn": "2022-04-25T07:12:00.007Z",
          "wordCount": 10576,
          "title": "Potpourri",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg1s0cDcIznlHncznR9DVrj6t23hqOnHhaBHd6gDTPgn8CIR3GvaNs53tQr-Fe2a25-Kp4LWYKhSHbU_Z4gVrtVY6VrnGSSmgQRek1hyPrvkiqRWga-4LLrE2PTC9d-PLX7hFmm96Y68-dt_RZK1uq17mb3lr7_zPdQ04K2b7QiAQ3uSS7t1ceS5sUw/w1200-h630-p-k-no-nu/equipement.jpg"
        },
        {
          "id": "https://knightattheopera.blogspot.com/2022/04/how-to-make-combat-spicy.html",
          "author": null,
          "description": "I have bigger, better articles in the works but I noticed my output has slowed down, so back into the vaults I go. I've dug up this list from many years ago and adapted it. This was inspired by a recent claim I made that there's such a thing as \"system-agnostic combat encounter design\" that you can and should learn, which many people were resistant to. Here was the original pitch I wrote for this:\n\n\nI've talked to many people who think that combat in 5E isn’t really fun. There are many arguments for this, some of which are perfectly valid and some of which just come down to subjectivity, but by far the most common argument is this: they say that because it removed so many mechanical elements from the process (e.g. flanking mechanics, using miniatures and grids by default, having to take fe…",
          "link": "https://knightattheopera.blogspot.com/2022/04/how-to-make-combat-spicy.html",
          "publishedOn": "2022-04-20T05:06:00.005Z",
          "wordCount": 4203,
          "title": "How to Make Combat Spicy",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiC_R1cK4P6jiQp9un9HKHmFjSIkEfAzn5-wWVhSz6pZvltYqdjYS5AfhgycGzNqRXmcPlZ8tIY31isjlitIxOmZJACigISQZuOVMcLuQFqzO6FRoBr0r3eVayDZFo-FJxnFdd7DUqtms9oVmZVSad8-jxSIUA98b7jABUMJhsWL83Y-uZqIklGUSq4/w1200-h630-p-k-no-nu/20211221_232926.jpg"
        }
      ]
    },
    {
      "title": "Rise Up Comus",
      "feedUrl": "https://riseupcomus.blogspot.com/feeds/posts/default",
      "siteUrl": "https://riseupcomus.blogspot.com/",
      "articles": []
    },
    {
      "title": "Weird & Wonderful Worlds",
      "feedUrl": "https://weirdwonderfulworlds.blogspot.com/feeds/posts/default",
      "siteUrl": "https://weirdwonderfulworlds.blogspot.com/",
      "articles": [
        {
          "id": "https://weirdwonderfulworlds.blogspot.com/2022/05/maximum-recursion-depth-2-or-sometimes.html",
          "author": null,
          "description": "New Game New Campaign! I will still be playing in a new MRD1 Campaign with the previous group online, being GMed by one of the Players of that campaign, but I'm also running an MRD2 Campaign IRL with a mix of IRL friends and people I've met through the RPG community online (who are now also IRL friends).\n\n\nI'm not 100% committed to this name, but I'm tentatively thinking it will be:\n\n\nMaximum Recursion Depth 2, or Sometimes Less is More and Sometimes More is More\n\n\nVery open to discussion on that.\n\n\nAnyway, first session was off to a really good start; with what is a partially new system/setting, and a new group, and one of the players having never RPed before, you never know how it will go, but I think we're gelling pretty much immediately. We spent most of the time finishing character cr…",
          "link": "https://weirdwonderfulworlds.blogspot.com/2022/05/maximum-recursion-depth-2-or-sometimes.html",
          "publishedOn": "2022-05-02T23:19:00.001Z",
          "wordCount": 4848,
          "title": "Maximum Recursion Depth 2, or Sometimes Less is More and Sometimes More is More: Campaign First Play Report (+ Design Notes)!",
          "imageUrl": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EwgOZBk4wMLQ2h4GTjZy6iHVvqVJmw---gLqax5ZE_TcSEXjjyiS9TinvYwKxwC1CxDMoJ10VupCZP3yE4lrtxnsEvQffWv9G7NGVrSt8GP6MJ2p9ohi69_Rzvt6K1OR-BMbtPKuCExnNXR1F5vsk35bwfobw=w1200-h630-p-k-no-nu"
        },
        {
          "id": "https://weirdwonderfulworlds.blogspot.com/2019/06/draft-undead-dreams.html",
          "author": null,
          "description": "The idea is loosely inspired by Vampire Hunter D, specifically Volume 5. What is an undead dream? This post was originally drafted in like 2019 and I was never sure what to do with it. I've had some similar ideas lately, I intend to explore some version of this further in the near future.\n\n\n\nThey say that when you die, your brain floods with DMT, the chemical of dreams. Your perception of time slows and you relive your life as synapses die and memories pop into being one last time. Memories are fuzzy and imperfect things, and in your psychedelic dreamscape your life plays out a little bit differently. Then, your dreamscape self dies, and it floods with DMT, and so recursively, at the moment of your death, you dream and live your entire multiverse of selves.\nThese recursive multiversal selves exist in a metaphysical space, a space of souls, where the soul-self opens the gate of the pineal gland and enters the collective unconscious.\nAnd what are undead, if not liminal beings, a physical, synaptic consciousness at the gate, lacking a soul, the apparatus to join the collective unconscious? Zombies don't hunger for brains, they hunger for souls. But no matter how hard they try, no matter how many brains they consume, they'll never be able to digest, to integrate, the soul. Weep for the pitiful hungry zombie. Vampires, lich lords, and other intelligent undead sleep, but without a soul, what do they dream?\nThey do not relive their lives, but the lives of those whose brains they've eaten, blood they've drank, bodies they've necromantically revived; damaged and mutated, the undigested souls linger within, propagating through a dark multiverse of astral un-life, the reciprocation of undeath, a limbo dimension of null that exists, cruelly, to balance the physical inequality of energy that undeath introduces into the universe. The undead dream the purgatory of the living.\n\n\n\n\nAlso, I made my first post on the collaborative blog Iconoclastic Flow!\nIconoclastic Rant: I am sick of being asked \"but how would that work?\"",
          "link": "https://weirdwonderfulworlds.blogspot.com/2019/06/draft-undead-dreams.html",
          "publishedOn": "2022-04-26T12:31:00.010Z",
          "wordCount": 2354,
          "title": "Undead Dreams",
          "imageUrl": "https://1.bp.blogspot.com/gn_vFsDELv20z0KsaSHZlLa6TtizIGVc6WYtxEHoOm9FG6leReamRtiPuVvFDNDjQfHQWMk97eqLT4FDgz-jJGY5pv2VPRMBudeO=w1200-h630-p-k-no-nu"
        },
        {
          "id": "https://weirdwonderfulworlds.blogspot.com/2022/04/bonus-iconoclastic-flow-collaboration.html",
          "author": null,
          "description": "I am involved in a collaborative blog! See the description from Screwhead's tweet below:\n\n\nIconoclastic Flow is a collaborative blog, with content from Max of Weird and Wonderful Worlds, Semiurge of Archons March On, Spwack of Slight Adjustments, Sibylla of  Devil Devil Devil, and Sofinho of Alone in the Labyrinth, as well as 4 lovely creatives from my real life!\n\n\nScrewhead being of the Was it Likely blog, who was doing brilliant FKR-ish stuff before FKR was even a thing.\n\n\nI've interviewed all of these bloggers before (see interview tag) and Devil Devil Devil is genuinely one of the most interest RPGs I've read in a while. The other friends of Screwhead I've also been getting to know a bit and they all seem cool as well.\n\n\nI've got one bog post there already drafted, but since Screwhead was the lead organizer, we felt he should be the one to kick things off, with:\n\n\n\nLords of Old; a GMless Competitive Social Deduction TTRPG of Gods in the Ruins of the Old World\n\n\n\n\n\nGiven how much I've bounced around on this blog between worldbuilding, game discussion, prose, game mechanics, coding stuff, interviews, weird experimental stuff like Weird & Wonderful Wavelengths, etc., I don't necessarily have a coherent idea of what will differentiate my posts there vs. here, and there may in fact not be any meaningful differentiation, it'll just be another place to read my stuff, so if you're already enjoying this blog, or any of the other creators involved in this collaboration, check it out.",
          "link": "https://weirdwonderfulworlds.blogspot.com/2022/04/bonus-iconoclastic-flow-collaboration.html",
          "publishedOn": "2022-04-21T13:19:00.002Z",
          "wordCount": 2103,
          "title": "BONUS: Iconoclastic Flow Collaboration!",
          "imageUrl": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EwZ3POyTnkIYMgIiBtlekINq2BEJO-uefHeuARzJRSbyAb642NBbDGo8rgPQRx4z28Y59-d5La4J_tGVqKh8gNZb5Qx63W3kJyAl-XsrackYpLg4YjMe02DAFNKy1R7q4MUC_YPwAWJS6dG=w1200-h630-p-k-no-nu"
        },
        {
          "id": "https://weirdwonderfulworlds.blogspot.com/2022/04/the-art-of-chrono-war-hexcrawl-across.html",
          "author": null,
          "description": "I get really excited about timey-wimey stuff, but then inevitably get frustrated when either I overcomplicate it or fail to explain it coherently or whatever, so I will try not to do that this time. This is not a redo of my previous multidimensional hexcrawl post which I'm still going to hyperlink but that is definitely a case where I overcomplicated an idea that actually isn't that complicated, and this is actually a completely different thing from that anyway, so don't bother reading that unless you like weird complicated shit. I liked the post even if basically nobody else did :(…\n\n\nThis post is partially inspired by Skerples' post OSR: Time Travel Tips for GMs and the idea that I had suggested in the comments that frankly I felt like he was a little too dismissive of so now I'm coming …",
          "link": "https://weirdwonderfulworlds.blogspot.com/2022/04/the-art-of-chrono-war-hexcrawl-across.html",
          "publishedOn": "2022-04-18T12:19:00.001Z",
          "wordCount": 3748,
          "title": "The Art of Chrono War: A Hexcrawl Across Time, Space, and the Multiverse",
          "imageUrl": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EzSCEakJ0zoAkM3Rwm8W3E6Gdil786Y0NdzUuSgTRire8zKUcY6QV10jPU6FqnGm2V0M29Pa9e0kOLZ0g66pILd9AnsUcKZnt8_hu66q9Oa_8u_a_7ugTvihJN7kud9mgp0SiBmB-ZRPAPPkRwF2s_h3oA=w1200-h630-p-k-no-nu"
        },
        {
          "id": "https://weirdwonderfulworlds.blogspot.com/2022/04/mrd-campaign-final-play-report.html",
          "author": null,
          "description": "The final play reports for my >1yr long Maximum Recursion Depth campaign. I can't fully express just how happy I am with how this all resolved, and how grateful I am for my players. I've played in or run a handful of >1yr long campaigns so far, and this is only the second to come to a proper conclusion, and the first to do so satisfactorily. This campaign truly lived up to the ideals of what I had intended MRD to be, and did so in a way that I had not anticipated, driven by the actions of the Players and the decisions they made given the conceits I presented to them. We'll be following up with a new campaign where one of the Players will take over as GM with their own modified take on MRD, and I'll be running an MRD2 campaign with a new group IRL, but this feels like a milestone in the jou…",
          "link": "https://weirdwonderfulworlds.blogspot.com/2022/04/mrd-campaign-final-play-report.html",
          "publishedOn": "2022-04-12T13:02:00.001Z",
          "wordCount": 5491,
          "title": "MRD Campaign FINAL Play Report",
          "imageUrl": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4Eyqz7OdZaC6mXnc42xDWKYa3WVN-OOzTKizUK-QAILOW3i4UsNEkDeI5fo0h3c6pSOHFLI8Z0j39gODtvz42de1Y-uNJ4YBToi3_-RvcFoCjC3hfzU0aEX2YjG0VxgZl3dFfZr-E58wRITNAEyNPfShk5NpYgxi4GWKZupN8RaEeUnUdNc29tj2lbr67oZMXwtR1CGN7fslmETyJ5neuQVLeFBhpLN_e3TZ=w1200-h630-p-k-no-nu"
        },
        {
          "id": "https://weirdwonderfulworlds.blogspot.com/2022/04/weird-mecha-metaphor-for-embodied.html",
          "author": null,
          "description": "This is the second batch of tables/Mecha, see first post here and an explanation of how this word-based Mecha Gear system works here.\n\n\nMecha are sometimes described as being a metaphor for the body- which makes sense, they are humanoid giant robots, often unnecessarily anthropomorphized, and often used to tell stories about the adolescent experience or the brutality of war. I don't mean to suggest this is all that Mecha entail, but this alone can be explored in ways that I have rarely if ever seen.\n\n\nIn the first post, the Golem (the MRD2 term for Mecha) were mostly extrapolations of humans as units within greater superorganisms- Entropy Elancer existing partially in the Fourth Wall outside spacetime, Lycaon Strain a macroscopic distributed organism, and Hibernating Hyberia an encrypted c…",
          "link": "https://weirdwonderfulworlds.blogspot.com/2022/04/weird-mecha-metaphor-for-embodied.html",
          "publishedOn": "2022-04-07T11:54:00.003Z",
          "wordCount": 2564,
          "title": "Weird Mecha: A Metaphor for Embodied Cognition",
          "imageUrl": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4Ew8gOwTSVAoPjCKSgCHcX4eRfzBIJT3ZmqXCpWADAQbix4JvkEIIB2mNMn5AtS2rBCd3nBfUjOHZj1RtX__rirIRi6iJrl9ZGA-4rV9Ll4y5Oxl-5JDWXaeJGZ86-F0N-NPyo-A4S72AI87q4723dtXcfSUXcaB33fcaJZ7UoqpBb8=w1200-h630-p-k-no-nu"
        }
      ]
    },
    {
      "title": "Tom Van Winkle's Return to Gaming",
      "feedUrl": "https://lichvanwinkle.blogspot.com/feeds/posts/default",
      "siteUrl": "https://lichvanwinkle.blogspot.com/",
      "articles": []
    },
    {
      "title": "RSS Feed Title",
      "feedUrl": "https://zotiquest.zeruhur.space/feed.xml",
      "siteUrl": "https://zotiquest.zeruhur.space/",
      "articles": [
        {
          "id": "https://zotiquest.zeruhur.space/cairn/2022/04/13/taintedweald/",
          "author": null,
          "description": "Since last year I was toying myself with the idea to write a setting inspired by Nausicaä of the Valley of the Wind, Hayao Miyazaki’s masterpiece. The first attempt was last year to submit for InPlay #3 (then never issued, alas), but I was not able to meet the deadline.\nThe idea stuck in my mind, for merrier times. Then other project came, fatherhood and everything connected to it.\nUntil Yochai Gal launched the *Forest of Another Name” Cairn Jam last month. The original deadline was March 31st and I know it was totally impossible for me to meet that deadline. Then it has postponed to April 15th and I was able to start writing my submission in time.\nThe result is Taintedweald, a mini-setting in a 24 pages zine. Let’s see it in detail!\nThe title is a portmanteau because they sounds good and …",
          "link": "https://zotiquest.zeruhur.space/cairn/2022/04/13/taintedweald/",
          "publishedOn": "2022-04-13T09:25:00.000Z",
          "wordCount": 914,
          "title": "Taintedweald: Designer's Notes",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Legacy of the Bieth",
      "feedUrl": "https://lotbieth.blogspot.com/feeds/posts/default",
      "siteUrl": "https://lotbieth.blogspot.com/",
      "articles": [
        {
          "id": "https://lotbieth.blogspot.com/2022/04/returning-to-krynn.html",
          "author": null,
          "description": "WotC just dropped news that they'll be bringing back the AD+D 2e settings of Spelljammer and Dragonlance. You can read all about that over at EnWorld if you're so inclined. \nI never got into Spelljammer -- I missed a chance to pick up some of the old boxed sets for literal pennies, and I still kick myself for it -- but the concept still holds loads of intrinsic appeal to me. I don't feel like I've seen a satisfying treatment of naval play in a D+D framework yet, and I'm curious to see how WotC approaches it. (I suspect that their approach to voyages and space probably won't be one that quite scratches the yearnings I have, but seeing how they tackle it certainly isn't a bad thing.) \nBut Dragonlance? Dragonlance was one of my main entrypoints into D+D. I started off with the superlative Ret…",
          "link": "https://lotbieth.blogspot.com/2022/04/returning-to-krynn.html",
          "publishedOn": "2022-04-22T05:04:00.006Z",
          "wordCount": 3700,
          "title": "Returning to Krynn",
          "imageUrl": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4ExOf87nzxCQ4sDjTzmpDpWnG2_1O7a9jW16aQqMDyI98wthIFnYMBE2xG2RzIZWBhopJ4LA6nEvmtrF0WMjBeQcOcbqg_DajmOaVNL6YpHHkjWhSg=w1200-h630-n-k-no-nu"
        }
      ]
    },
    {
      "title": "Slight Adjustments",
      "feedUrl": "https://slightadjustments.blogspot.com/feeds/posts/default",
      "siteUrl": "https://slightadjustments.blogspot.com/",
      "articles": []
    },
    {
      "title": "Another Hamsterish Hoard",
      "feedUrl": "https://hamsterhoard.home.blog/feed/",
      "siteUrl": "https://hamsterhoard.home.blog",
      "articles": [
        {
          "id": "http://hamsterhoard.home.blog/?p=1035",
          "author": "taichara",
          "description": "A world of endless towers, this. Towers of purest precious ice, delicate and ethereal, a colourless beauty to steal one’s breath. A realm of shining latticework minarets, of smoothly bulbous spires and clockwork obelisks, of ever-shifting, ever-growing, ever-branching towers upon towers that build themselves upwards — ever upwards — and onwards, forever towards the glittering … Continue reading Z’shi (Foundation) →",
          "link": "https://hamsterhoard.home.blog/2022/04/29/zshi-foundation/",
          "publishedOn": "2022-04-29T11:43:44.000Z",
          "wordCount": 746,
          "title": "Z’shi (Foundation)",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=1032",
          "author": "taichara",
          "description": "There are mysteries in the deeps; mysteries and secrets and lost things, and the spinning tales and of unfathomable beings to be found nowhere else but in the fathomless deep. And then, there are also those that prefer to keep themselves amongst those lost and secret things — The darkness of water conceals all: the … Continue reading Yroon: Foundation →",
          "link": "https://hamsterhoard.home.blog/2022/04/28/yroon-foundation/",
          "publishedOn": "2022-04-28T13:51:34.000Z",
          "wordCount": 715,
          "title": "Yroon: Foundation",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=1026",
          "author": "taichara",
          "description": "That’s right, doing terrible things with other languages now to fit letters — How about a few interesting folks to meet on your travels? Love and friendship not, alas, guaranteed; but it’s not impossible ~ 01. Linet Woodwalker Born and raised in Rowan’s Cross, a sprawling broch complex in the Shadow, Linet sports both the … Continue reading Xenos Philios →",
          "link": "https://hamsterhoard.home.blog/2022/04/27/xenos-philios/",
          "publishedOn": "2022-04-27T13:40:24.000Z",
          "wordCount": 1247,
          "title": "Xenos Philios",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=1022",
          "author": "taichara",
          "description": "The City of Chains exists everywhere and nowhere, they say — an endlessly unfurling urban maze of black-and-jewels, ancient stone and stranger metals, built upon deeper labyrinths still while the great chains arc and coil far overhead across the glassy dome of the strangely coloured sky. Few come to Wilusa deliberately, at least at first. … Continue reading Wilusa, City Of Chains →",
          "link": "https://hamsterhoard.home.blog/2022/04/26/wilusa-city-of-chains/",
          "publishedOn": "2022-04-26T12:29:51.000Z",
          "wordCount": 767,
          "title": "Wilusa, City Of Chains",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=1019",
          "author": "taichara",
          "description": "Sand. All around is sand, golden and drifting, broken up by white-gleaming ziggurats and their sprawling cities picked out in azure and jade, by fallen tawny ruins, by precious expanses of pale green growth ringed around pools of sweet water dark as the eternal night above with its rippling sky-vault and great electrum stars. The … Continue reading Valiance: Manifold Palace →",
          "link": "https://hamsterhoard.home.blog/2022/04/25/valiance-manifold-palace/",
          "publishedOn": "2022-04-25T11:49:14.000Z",
          "wordCount": 693,
          "title": "Valiance: Manifold Palace",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=1016",
          "author": "taichara",
          "description": "Welcome to the White Winds, traveller: with its endless skies churning gently through all the shades of blue and twilight to the deepest violet-darkness and back again; with the namesakes of the plane, the white winds that etch elaborate scrolls and spirals and twisting knots into the masses of pearly cloud that form and drift, … Continue reading Ushil: Foundation →",
          "link": "https://hamsterhoard.home.blog/2022/04/24/ushil-foundation/",
          "publishedOn": "2022-04-24T12:34:30.000Z",
          "wordCount": 700,
          "title": "Ushil: Foundation",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=994",
          "author": "taichara",
          "description": "You can pick up all sorts of oddments as you wind your way around, across and through the worlds, really ~ d100 01 psychopomp’s lantern, a staff of black heartwood hung with lantern-cage andsoul-pyxes 02 double handful of solaurum and lilyglass clockworks, eternally moving andsoftly chiming 03 shard of ivory-like substance shot through with silvery … Continue reading Trinkets, Trifles and Treasures →",
          "link": "https://hamsterhoard.home.blog/2022/04/23/trinkets-trifles-and-treasures/",
          "publishedOn": "2022-04-23T13:28:37.000Z",
          "wordCount": 1558,
          "title": "Trinkets, Trifles and Treasures",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=991",
          "author": "taichara",
          "description": "It’s a calm, unassuming sort of plane at first, the Shadow is. Plenty of broad fields and lush water meadows, sprawling copses of luxuriant trees with game ready for one’s snare or arrow, nothing is burning or discorporating or transmogrifying before one’s eyes. But then – then the eternal creeping sunset registers, and the strange, … Continue reading the Shadow →",
          "link": "https://hamsterhoard.home.blog/2022/04/22/the-shadow/",
          "publishedOn": "2022-04-22T13:04:10.000Z",
          "wordCount": 840,
          "title": "the Shadow",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=988",
          "author": "taichara",
          "description": "Warmth, banked against future need in the face of the cold, inside or out. Quiet contemplation, waiting to be stoked to white-hot readiness at a moment’s notice. Flame, contained, in the flow of syrupy rivers, rumbling orange and sizzling gold; in the banks of steady-glowing embers breaking through black-ashen hill-crests; in the deeply ruby carbuncle … Continue reading Rahure: Foundation →",
          "link": "https://hamsterhoard.home.blog/2022/04/21/rahure-foundation/",
          "publishedOn": "2022-04-21T12:58:15.000Z",
          "wordCount": 733,
          "title": "Rahure: Foundation",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        },
        {
          "id": "http://hamsterhoard.home.blog/?p=983",
          "author": "taichara",
          "description": "There are realms which unfold beneath the great expanse of the skies, whatever those skies may be. There are planes of seemingly infinite void, with or without structure or object to mar them. The Iron Court is not one of these realms. No matter where, no matter how one passes into Quietus, one’s arrival is … Continue reading Quietus, the Iron Court: Manifold Palace →",
          "link": "https://hamsterhoard.home.blog/2022/04/20/quietus-the-iron-court-manifold-palace/",
          "publishedOn": "2022-04-20T13:23:17.000Z",
          "wordCount": 856,
          "title": "Quietus, the Iron Court: Manifold Palace",
          "imageUrl": "https://hamsterhoardhome.files.wordpress.com/2019/10/cropped-desertjewel001.png?w=200"
        }
      ]
    },
    {
      "title": "New School Revolution",
      "feedUrl": "https://newschoolrevolution.com/feed.xml",
      "siteUrl": "https://newschoolrevolution.com/",
      "articles": [
        {
          "id": "https://newschoolrevolution.com/2022/05/04/the-new-new-school-revolution",
          "author": null,
          "description": "The New New School Revolution",
          "link": "https://newschoolrevolution.com/2022/05/04/the-new-new-school-revolution",
          "publishedOn": "2022-05-04T00:00:00.000Z",
          "wordCount": 2079,
          "title": "The New New School Revolution",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Slight Adjustments",
      "feedUrl": "https://slightadjustments.blogspot.com/feeds/posts/default",
      "siteUrl": "https://slightadjustments.blogspot.com/",
      "articles": []
    },
    {
      "title": "Quarterling’s Corner",
      "feedUrl": "https://quarterlingscorner.blogspot.com/feeds/posts/default",
      "siteUrl": "https://quarterlingscorner.blogspot.com/",
      "articles": [
        {
          "id": "https://quarterlingscorner.blogspot.com/2022/04/the-four-channels-of-creative.html",
          "author": null,
          "description": "I’ve come up with what I think is an interesting and useful way of thinking about RPGs, but the seeds of it were planted in my head by an unlikely source.\nI was watching this GDC talk by Mick Gordon about how he created the music for Doom (2016). In it, he describes how his main instrument for the game was a simple sine wave — what he describes as the purest form of sound — filtered through four channels of machines that distort the “pure” sound into something industrial, noisy, and full of character.\nIn a previous post, I described all RPGs as the product of different kinds of “creative constraints” upon play-pretend, which you might call the “purest form” of RPG. I listed various kinds of constraints, but this GDC talk made me think — what if I reorganized those constraints into four cha…",
          "link": "https://quarterlingscorner.blogspot.com/2022/04/the-four-channels-of-creative.html",
          "publishedOn": "2022-04-10T15:42:00.000Z",
          "wordCount": 1945,
          "title": "The Four Channels of Creative Constraints on RPGs",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgQ3k0fEoDc9hjx6PFmKsVjUZusljwYsQDnIKegrusJzJxR0MSQLW4EAMb2BgsuijI4GEdVFe5qU7QyhdXUA3MZq-VWrsmuo6ApTd9BQMoGE1ccsNXpRIO1OE-t9xy8l8daG5TZahe38-8QXGtbMyheS3lllyJkLtT-2KhrfsbL1JUku-Onk-QJKKVCjQ/w1200-h630-p-k-no-nu/C5287FFB-31BB-48FC-9402-2B53FCB12387.jpeg"
        },
        {
          "id": "https://quarterlingscorner.blogspot.com/2022/04/untitled-wbfmag-hack.html",
          "author": null,
          "description": "I wrote this little White Box: FMAG hack over the course of the past few hours. I like how Spwack posts little hacks straight to their blog, so I figured I'd try something similar.\nI basically just stripped down how Worlds Without Number does ability checks and simplified attacking to one roll. The non-standard attributes, combat order, and Difficult Movement rules come from my big WIP, Goblets & Grues.\nI might try using this to run OSE adventures and the like, who knows.\n\n\nCharacter Creation\nRoll 3d6 for your six attributes:\n\nStrength. Climb, swim, jump, push, pull, lift.\nDexterity. Keep your balance, perform simple acrobatic stunts.\nCharisma. Persuade ambivalent NPCs, put on a charming or convincing performance.\nCraft. Create, tinker, repair, or operate.\nStealth. Sneak, hide, perform sle…",
          "link": "https://quarterlingscorner.blogspot.com/2022/04/untitled-wbfmag-hack.html",
          "publishedOn": "2022-04-08T22:34:00.001Z",
          "wordCount": 1398,
          "title": "Untitled WB:FMAG Hack",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhJ8slRc6MgtOX9KHtZix6RKLi88RIhw7iKET5_fY6zwMxySg5fmDRRedB6f7aXR4umkE1Vhnl-pxirk5FtvMFezR66SSN34Fu0WOG7CR4RjSBpgiBTOuG09uV83M1vzX6b8RX6WKFJhCb4_q6eHXffgk3Z-UXs8VSJfj5L6aRTUGxpba3AnXYyNgwwfQ/w1200-h630-p-k-no-nu/7374953B-C72C-4E83-94BC-482B7EDB676D.jpeg"
        }
      ]
    },
    {
      "title": "Prismatic Wasteland",
      "feedUrl": "https://www.prismaticwasteland.com/blog?format=rss",
      "siteUrl": "https://www.prismaticwasteland.com/",
      "articles": [
        {
          "id": "5fc42d3b9955c744b550776c:5fc449cf7acac6192a4958a4:625f03a6e1e7a5759fe651ee",
          "author": "W. F. Smith",
          "description": "A procedure for building a starting scenario (and the seeds for building a \r\nworld) for both referees and players at the start of a new campaign.",
          "link": "https://www.prismaticwasteland.com/blog/worldbuilding-as-a-team-sport",
          "publishedOn": "2022-04-26T13:14:59.000Z",
          "wordCount": null,
          "title": "Worldbuilding as a Team Sport",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "5fc42d3b9955c744b550776c:5fc449cf7acac6192a4958a4:62508e764b70f661a351e7d1",
          "author": "W. F. Smith",
          "description": "It isn’t much fun to convert monsters from system to system. The answer is \r\nto not give non-diegetic stats for the monsters in your system-neutral \r\nadventures.",
          "link": "https://www.prismaticwasteland.com/blog/universal-system-neutral-stats",
          "publishedOn": "2022-04-18T13:31:45.000Z",
          "wordCount": null,
          "title": "Universal, System-Neutral Stats",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Bearded Belgian's Playground",
      "feedUrl": "https://thebeardedbelgiansplayground.blogspot.com/feeds/posts/default",
      "siteUrl": "https://thebeardedbelgiansplayground.blogspot.com/",
      "articles": [
        {
          "id": "https://thebeardedbelgiansplayground.blogspot.com/2022/05/mixing-story-telling-and-post-osr-fates.html",
          "author": null,
          "description": "I had a thought today. \nLet's treat is as pasta and throw it to the digital wall to see if it sticks.\nRecently on the Cauldron forums there were some thoughts and wishes for divides between different communities of play to be crossed somehow. Combine this with me thinking recently that it would be fun to play Electric Bastionland with a system that suits my story-telling sensibilities a bit more. I was thinking RISUS, since that's my go to, but then I got to thinking about FATE Core's Session 0.\nYou see, not only do you create your own character in FATE Core if played, RAW, but you also work together to decide which setting, genre, theme's, etc. there would be in this game. And that's where I was thinking that it would be fun to take electric Bastionland's Borough creation (or the other types of maps) and make it a communal thing. I've attempted making it communal in the beginning of this year with the kids, but using end of class time is a bit short, so that failed. But with this I can revisit it. Everyone could take turns adding routes, choosing the type of road it is, etc. Besides that, keep the two aspects for the game itself: Current Issues and Impending Issues. These can fuel and/or be fueled by whatever is created already, be it faces and places or something like that.\nThe Faces and Places from Fate create instant NPC's to place on the map (if they are on the map) or to tie to the greater world. The Spark Tables and the Backgrounds of Electric Bastionland cans till be rolled on or used as inspiration for creating our starting situation.\nI don't know if this is a thing that I will have time to test out anytime soon, but I hope to try it out soon-ish.",
          "link": "https://thebeardedbelgiansplayground.blogspot.com/2022/05/mixing-story-telling-and-post-osr-fates.html",
          "publishedOn": "2022-05-01T16:20:00.002Z",
          "wordCount": 1141,
          "title": "Mixing Story Telling and (Post) OSR - FATE's Session 0 x Electric Bastionland's Borough Creation",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "d4 Caltrops",
      "feedUrl": "https://blog.d4caltrops.com/feeds/posts/default",
      "siteUrl": "https://blog.d4caltrops.com/",
      "articles": [
        {
          "id": "https://blog.d4caltrops.com/2022/05/d100-haven-happenstances.html",
          "author": null,
          "description": "Here are one Hundred Haven Happenings or Settlement Events for dressing up any downtime in towns and villages (or even decorating Domain Play, which could certainly use a little more love).\nSome are good, others bad, and still others in-between. These might eventually get a more rigorous treatment as a series of d36 tables to interface with my normal way of handling such things (Reaction Roll), but capturing the ideas immediately is always vital so they don’t get whisked away 😊.\n See also: These Village-Folk Are... and These City Dwellers Are... as well as One Hundred Buildings and Business.",
          "link": "https://blog.d4caltrops.com/2022/05/d100-haven-happenstances.html",
          "publishedOn": "2022-05-05T23:25:00.000Z",
          "wordCount": 898,
          "title": "d100 - Haven Happenstances",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMCpn46AhHGYCTgKHAo5ecHDTAOCS-APCJW96b-dg8fF3TMlVmU6cM-hJcpbAnxe6rqa0PCN-XRS8KJRoY8dp8rLYsvUuXZmIFb5DeOCJbq68ulX6EU7g_8UAg_Z8K-AvDlMM2BMRtrXoR_B9I5yECSzdGf4M-84cRI5sZTchVRr6ofD2C6Q9Ba2oh/w1200-h630-p-k-no-nu/Haven%20Enents.png"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/05/d100-mercurial-mentors-weird-wizards.html",
          "author": null,
          "description": "There is a rather lovely bit of implied world building secreted away in the Spell Acquisition process for Magic Users in B/X and OSE. Whilst I also permit transcription from Scrolls and captured Spell Books as an alternative arcane augmentation avenue, by default the only two options for expanding a Medium’s occult repertoire are Research (touched on previous posts here and here) and a mention of Mentors.\n Sadly, these Thaumatological Tutors do not really receive any substantial detail, so this table aims to address this oversight. The Sorcerous Instructor can be determined alongside the Starting Spell the Magic-User begins play with, or one can simply combine results to mint new Mentors. Starting with a Name and a distinguishing Trait provides a little bit of background, may raise interes…",
          "link": "https://blog.d4caltrops.com/2022/05/d100-mercurial-mentors-weird-wizards.html",
          "publishedOn": "2022-05-03T12:30:00.000Z",
          "wordCount": 1180,
          "title": "d100 - Mercurial Mentors & Weird Wizards",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiyRJ8smnF50z-YE_eVIUcdmqiDjytiU5MOSK_47_yRM7qX4O1MBS4eiWIkIPhahxF-H1B_knavYPy_oEg7tGeY_zpdaFFMTBtHGTnJ0cZRtDnzTWZX-HvQgThrVc_FqEnndvDs8TSkIZMLvqdljGWRiYX3RjGvBgRNN90p8JcOSFZT96ug1GCY_Nny/w1200-h630-p-k-no-nu/Wizard%20Post.jpg"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/05/d100-scroll-substitutions-or-strange.html",
          "author": null,
          "description": "Dramatically unfurling that rolled up piece of parchment or paper to intone the Magic Words ensnared in sigils on the surface is a very lovely and iconic mental image for me. But sometimes I like to house these “single-serving Spells” in other, less traditional actions and items. These might be especially useful for Magical Traditions that encode their dweomers in ways that are not dependent on literacy or pulped wood, or just atypical treasures placed for a slight change of pace.\n Standard Scroll rules would apply for these. I would personally still stick with my favorite Creation Rules from Holmes (100 gp and 1 week per Spell Level, halve time or cost with the appropriate Reagents/Ingredients).\n Here’s a Hundred alternatives to consider in the place of that voluted vellum. Perhaps every caster learns a different method from their Mentor, as a sort of signature? These might also mesh nicely with my One Hundred Spellbook Surrogates & Ritual Research table.",
          "link": "https://blog.d4caltrops.com/2022/05/d100-scroll-substitutions-or-strange.html",
          "publishedOn": "2022-05-02T12:01:00.000Z",
          "wordCount": 970,
          "title": "d100 - Scroll Substitutions or Strange Spell Stores",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEivXfEGZeLeriMNr-cuNoioSuAeezWAGJxmF9wXguk0r8S20E1mCoYvwuig7UTRFRXGRj-Z9iA8-uXmiVNE20YXt6JmTNpmxajlkOtYV3CN21x5GLHxHCsZTW32hnsLwU7ExL8LXBTH7zzti0xRv6V4Ttojn5XYEVv_zf0dFLDFcADikEME_l0MKbW6/w1200-h630-p-k-no-nu/Scroll%20Post.png"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/04/d100-modern-pocket-finds.html",
          "author": null,
          "description": "Just a quick table that I was reminded of today going through my folders. I believe I whipped this up for another Referee in need quite some time ago, but after giving it another gander and thought it might be of use to others.\n Kind of a contemporary counterpart to my Random Impedimenta. Might also be useful for post-apocalyptic games or ones set in slightly older historical periods, as there is a whiff of anachronism in some of these. These days most of my tables are geared toward Fantasy, but even in that context I’ll admit to sometimes sprinkling in the occasional item from this as an intriguing/puzzling out-of-place artifact or a teaspoon dosage of gonzo. I always endeavor to render the trinket via a description rather than name it though in these situations 😊",
          "link": "https://blog.d4caltrops.com/2022/04/d100-modern-pocket-finds.html",
          "publishedOn": "2022-04-16T16:56:00.000Z",
          "wordCount": 997,
          "title": "d100 - Modern Pocket Finds",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhVA7O_LjLmHUQs9MFMb1FrnV6olrJTzBT6V33QbaPFVA-D-FdFKcQbxdOtAiPCa-KyxMOIrkpqokFZouIkFAJBWLzqocaiPfFx4qq_9LA3-kIhRcFVFYvQEWTA-oiouYfvutFBBgyLiFA0ewNjCZiTcGBlRQcXeno1epr-_3S0mD56-C4IyQqhe8vj/w1200-h630-p-k-no-nu/Pocket%20Post.png"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/04/d100-convenient-cantrips-or-minor-magics.html",
          "author": null,
          "description": "Now and again, I come across Referees considering Cantrips as a way of adding a little bit more Magic to their Spellcasters. These are a sometimes-contentious subject because some implementations result in these abilities interfering with or obviating interesting parts of play such as Resource Management. Another common issue sometimes has to do more with Setting conceits, and how they can sometimes transmogrify something treasured or rare into a thing much more mundane or humdrum.\n   \nBut take heart! Not all sorceries need be showy ones, and the wonder these sorts of “special effects” can evoke can sometimes add more than they subtract from play if we are just a little scrupulous in how they function. When I use these, I like to make sure that there are a few rupestrian rulings communicat…",
          "link": "https://blog.d4caltrops.com/2022/04/d100-convenient-cantrips-or-minor-magics.html",
          "publishedOn": "2022-04-15T17:48:00.000Z",
          "wordCount": 1703,
          "title": "d100 - Convenient Cantrips or Minor Magics",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjrDNl0_0fFQC9FnFZyiWYSAzoBhxYyeqKywMb_1GtHqDoswamBcqD96jt6BJ9068HTMfHGJ2truAC1qf5rYYCI_1Qw3V-qpp_zKoWqcikpae9nqUf7BDn5auyRpFEDQPo28QTiFTthMFrSMgoPFaRBsc6g8cp_xMsgEkQ3NsBUKWr6-2LbYlrdWNY8/w1200-h630-p-k-no-nu/Cantrip%20Post.jpg"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/04/d100-marvelous-mushrooms-tantalizing.html",
          "author": null,
          "description": "Yesterday it was pointed out to me that I had been remiss with providing a Random Table for generating Mushrooms/Toadstools, which is indeed a tragedy considering how fond I am of sprinkling “fun” fungi as Resources and Hazards within my Wilderness Adventures. So, I aimed to rectify this oversight post-haste by moving this Table to the top of the dev pile (where in all fairness, it sprouted with almost uncanny swiftness).\n These can be used in conjunction with my venerable Herb & Plant Generator, and although the Name-stems are intended to be used to generate new and unusual Local Common Names, you can just as easily read across if swiftness is required and treat this more like a standard d100 table. I often like a quick name for flavoring Foraging Results as “You found some Edible Mushrooms” is just so frightfully bland.\n Use your best judgement to determine an appropriate randomizer if you find yourself in need of a “Number Appearing” (I'm rather fond of 2d6 with \"Doubles Add and Roll Again\" most of the time, but you could also randomize the die type to use with a quick d8: d4 through d100.) I prefer to heavily festoon some places in evocative fungi as a mood-enhancer, but a few of these are probably best when more precious and significantly rarer. If not expressly edible, and you find yourself in need of a nastier consequence for the foolhardy consumer, there is always my Terrible Toxins & Vile Venoms Table as well.",
          "link": "https://blog.d4caltrops.com/2022/04/d100-marvelous-mushrooms-tantalizing.html",
          "publishedOn": "2022-04-14T13:27:00.003Z",
          "wordCount": 1198,
          "title": "d100 - Marvelous Mushrooms & Tantalizing Toadstools",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgnrSQb02DyIHMSxgauk7ZyeLdEajMaGSL7nKGhCPbzLnnyaPcTvMPIyuxWtJepkZmVOD8j0VpHlRi9i-k3grH1CEnkhJ3aMw2Edv4SdQD995Z29l_6S1jlsIbJ_R0TX9R0QRJcIhshNIxdH3mSxXpLpxcZ-r6yuYfIVnpZN5qFA_dRYZSCWtFftBre/w1200-h630-p-k-no-nu/Mushroom%20Post.jpg"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/04/d100-one-hundred-horses.html",
          "author": null,
          "description": "Growing up around Horses, how I use them in these games might be one of my vernacular tells. One of those little things that I always seem to do, despite what the system might say. When I was younger, I had the privilege of spending some of my Summers with these animals, grooming, riding, but mostly I remember mucking out intolerably mephitic and sweltering Stables for extra pocket money (some of which even went to Roleplaying Game Books!).\nHorses can be incredibly frustrating and thick-headed creatures, or remarkably patient and even helpful. Some are tender and kind, others are just plain mean to anything that walks on two feet or four. Getting to gradually know them over time, you soon learn little peculiarities and peccadillos that might not be obvious at first glance. Each one ends up…",
          "link": "https://blog.d4caltrops.com/2022/04/d100-one-hundred-horses.html",
          "publishedOn": "2022-04-12T19:17:00.002Z",
          "wordCount": 1196,
          "title": "d100 - One Hundred Horses",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi1X_-zJiMTsyEu4tcIvmDHEXwk23N-YyVIXkYR2PpexksxGSpxrPwDqKPbxT_WmAknXHJHYHd75-ZyosZ5fEl48NW3WueC4IFG1OC_kbichFREmM9eOFlgWA7kvOMSRZnirUZeM4fX0qxZR8lNiWHG2bkZG_CBQtihKsSFgPagaXfZ7vjxO1NRIJdK/w1200-h630-p-k-no-nu/Horse%20Post.png"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/04/d100-this-shield-spell-appears-as.html",
          "author": null,
          "description": "See Also: One Hundred Magic Missiles  \n\n Oftentimes I like to encourage any Magic-Users to tailor the appearance of their dweomers a bit: Customizing them by Caster for a little individuality. I often find myself doing this for Foes to keep the other players on their toes as well. The rather generic description of the Shield Spell is one that I felt could use a little sprucing now-and-then. Invisible fields of force might still function of course, but it seems like a missed opportunity to make that Magic less monotonous and a little more Magical. 😊\n Here are a hundred ideas for dressing up those defensive spells. This is solely intended to serve as a dollop of fluff and flavor of course...Unless?",
          "link": "https://blog.d4caltrops.com/2022/04/d100-this-shield-spell-appears-as.html",
          "publishedOn": "2022-04-11T14:21:00.000Z",
          "wordCount": 967,
          "title": "d100 - This Shield Spell Appears As...",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6fCdq7qGq-Jk0GWwleAB1ruuFboFwH2CNEQWLXmGi3bjRXxXmBI8SFStqA-OSCgGMjQhJbPMd1WWyVg7c-bYDuy0lBGOPXw_XmLVsE-x2PLR_B44dywpb5VYc2dxrquDda6U-FMofJTZXpKq6wiWj4AuzQR_7YM2fNH5s63eYOKhS0heY-XRR2Eu8/w1200-h630-p-k-no-nu/Shield%20Spell.png"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/04/d100-why-is-garlic-so-stinking-expensive.html",
          "author": null,
          "description": "Here is a somewhat tongue-in-cheek diversion from what might be considered slightly more useful Random Tables. It has always been extremely interesting to me how the standard Equipment lists in these games do so much heavy lifting to telegraph Setting, and I often tend to see players new to the game gravitate to a few of the same things.\n Allium sativum on the list alongside other, perhaps more practical, purchases for Dungeon Delving is one of these. Its mere presence seems to scream to some that the possibility of Vampires is not only very real, but something they ought to prepare for. The same way those lovely Saving Throw Categories, so starkly listed on their sheet, stoically advertise other dangers.\n But what may have gone unnoticed is just how pricey that lovely little Bulb can be. A little casual research reveals that it tends to stay remarkably stable pricewise in these older games. Naturally, this led me to wonder Why?\n So, here is a table of a Hundred ways to address this burning question (admittedly over-contemplated on my part) and these weird implications. It just goes to show that there are all sorts of lovely little nuances living in those lists that are hiding and waiting to be revealed by Referee’s with perhaps too much time on their hands.😂",
          "link": "https://blog.d4caltrops.com/2022/04/d100-why-is-garlic-so-stinking-expensive.html",
          "publishedOn": "2022-04-10T18:47:00.000Z",
          "wordCount": 1181,
          "title": "d100 - Why is Garlic so Stinking Expensive?",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEii3QFeMWeWsrF8721e6oBEwovJgDA_aOMe750vNKjFR4evJrz_FJULxygEEwWhKyVhOldoZU-rCkUSXJBzcu_IjLBYQpMnepQLVpm2t5VwVoO8hG7XOZccob7cFPSrV1TNwZhDrVgLCcUC6uKE3I3O9Zk9-GhvKUuH5d5pCoXnKjcSD4_Fs7d5xrGP/w1200-h630-p-k-no-nu/Garlic%20Prices.jpg"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/04/d100-magical-mishaps-calamitous-curses.html",
          "author": null,
          "description": "Yet another table that had been languishing on the dev pile for far too long! Here we have One Hundred Magical Mishaps or Calamitous Curses to inflict upon the table. Since some games don’t have a “Roll To Cast” system in place, these could also be repurposed for all manner of other unfortunate Eldritch Events. Potion Miscibility is popular, but they may also prove useful for Failed Experiments, Scrambled Scrolls, or Grimoires Protected from Prying Eyes. Some of them make mighty fine Horrible Hexes as well, much more memorable and meaningful than a mechanical malus (that players have a remarkable tendency to conveniently forget to apply!)\n Grafting on additional risk to Spell Casting is something I’ve done in the past. However, I feel it works a bit better if it’s accompanied by a correspondingly tempting reward. One that I particularly enjoyed was allowing a thrill-seeking Magic User to choose to roll a Saving Throw versus Spells after Casting, on a success the Spell is retained and they may cast it again. On a failure, the Spell is lost as with normal Vancian magics. On a 1, a Magical Mishap occurs. One can tweak the frequency of these fantastic failures to taste, or potentially even penalize the Save by the level of the Spell or number of prior retentions attempts in a given time-period. When Magic becomes predictable and repeatable, it can sometimes veer toward banality, so this at least tries to maintain a bit of that delicious wonder should one go down this route.    \nA small amount of effort was put into “tuning” this table a bit, so that smaller die sizes have less “consequential” impacts, so feel free to escalate these however you see fit. What happens with a d6 should be a little less severe than something rolled higher on a d30, with the more disastrous consequences generally occurring only on upper ends of the d100. Durations are occasionally included, but feel free to season those to taste, and as with all misfortunes some just might be possible to undo through additional Adventure.",
          "link": "https://blog.d4caltrops.com/2022/04/d100-magical-mishaps-calamitous-curses.html",
          "publishedOn": "2022-04-09T01:52:00.002Z",
          "wordCount": 1189,
          "title": "d100 - Magical Mishaps & Calamitous Curses",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhpoe-YXJSxeu9d6_N6HoOJhxZh0kcG0qK3hC0QN1uypbmv0O9DAuZRuwzAj1JFXuGzKopoFQccFzWkCEA0e3nLuCRYlREsUtzu3oB2Nm0UwERJVhRbvh6XkJ-veZ6Fi-JDYbpE1CTftNxJBcZX2jtzTYz70btXwdhqSD3ZY2Wb3YHY1ZBCg3AeYaBA/w1200-h630-p-k-no-nu/Magical%20Mishaps.png"
        },
        {
          "id": "https://blog.d4caltrops.com/2022/04/d100-breath-weapons-for-dragons-of.html",
          "author": null,
          "description": "How conveniently color-coded those standard Dragons are! Telegraphing their offensive and offensive capabilities so! This can sometimes demystify these majestic Monsters a bit, so here’s a table that might provide some additional inspiration to surprise and bewilder by eschewing that predictability. Should you need an unusual shade for their scales to shimmer see the perchance generator below.\n  \nNaturally, one should assume that any standard effects and procedures associated with being doused in Dragon Breath should apply. These are merely adjuncts. Coupled with my prior post on Monster Special Attacks, I suppose this could also be used for foes of a less draconic nature should this be your bag.",
          "link": "https://blog.d4caltrops.com/2022/04/d100-breath-weapons-for-dragons-of.html",
          "publishedOn": "2022-04-07T13:27:00.000Z",
          "wordCount": 971,
          "title": "d100 - Breath Weapons for Dragons of a Different Color",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3OqszwnBeIXpVx-3AzmvDFtspr24SbR_TAyJilt9rNqYC6Sz05Cvs50KSPzMlhj7Y_edeJC-TCxHwXO8iwrxRV38laEprSx0jUH6dqsuJUR3W-AGOe81AmCmLhTEyHdNiV26CQ3hWnkOteWmNz1U1hwaey92CsFaWggqGdL9AdM-ANyRI8sYbCg5g/w1200-h630-p-k-no-nu/Dragon%20Breath.jpg"
        }
      ]
    },
    {
      "title": "Hopeful Weird Wonder",
      "feedUrl": "https://hopefulweirdwonder.blogspot.com/feeds/posts/default",
      "siteUrl": "https://hopefulweirdwonder.blogspot.com/",
      "articles": []
    },
    {
      "title": "Academy of Doors",
      "feedUrl": "https://feeds.feedburner.com/AcademyOfDoors",
      "siteUrl": "https://academyofdoors.blogspot.com/",
      "articles": []
    },
    {
      "title": "The Cosmic Orrery",
      "feedUrl": "https://thecosmicorrery.blogspot.com/feeds/posts/default",
      "siteUrl": "https://thecosmicorrery.blogspot.com/",
      "articles": [
        {
          "id": "https://thecosmicorrery.blogspot.com/2022/04/books-ive-done-gone-and-read.html",
          "author": null,
          "description": "Being, as is previously stated, a list of books I've done gone and read and my miscellaneous thoughts upon them. \n\n\nThe Three Musketeers (Alexander Dumas)\n\n\nI'd attempted to read this several times before and succeeded in finishing this time. There's a perverse tragic hilarity to the story, most of the characters are often fairly awful people but are nonetheless entertaining. The whole thing meanders about, speeding up in places and rushing along before cooling and wandering once more. This varied between enjoyable and annoying for me, depending on how I felt about the particular chapter.\n\n\nMilady is perhaps the best character, she radiates palpable fury, the first time we actually get a close look at her and hear her speak in the text she dashes a fan to pieces in rage. I'm not sure if an…",
          "link": "https://thecosmicorrery.blogspot.com/2022/04/books-ive-done-gone-and-read.html",
          "publishedOn": "2022-04-30T01:10:00.003Z",
          "wordCount": 1786,
          "title": "Books I've Done Gone And Read",
          "imageUrl": null
        },
        {
          "id": "https://thecosmicorrery.blogspot.com/2022/04/unicorn-meat-review.html",
          "author": null,
          "description": "Dan D (of the venerable blag, Throne Of Salt) has recently released Unicorn Meat an adventure about a rundown unicorn farm in the backwoods taken over by ex-indentured, feral young girls, and other horrible thing. And it is fantastic.  \n\n\n***\n\n\nThe safety section <3\n\n\n***\n\n\nThere is a very deep sense of….. coziness? Is not the right word, humanity perhaps. Familiarity? Closeness? Despite the horrid situation. The characters in the module carry a large part of this. So does the setting, something about the muggy backwoods crawling with terrible monsters rings a note within. It all feels horrible in a deeply human and sympathetic way as well as alien and terrible.\n\n\nThe vaguely late 19th century setting also interplays quite well with the aforementioned familiarity (I do not think the module…",
          "link": "https://thecosmicorrery.blogspot.com/2022/04/unicorn-meat-review.html",
          "publishedOn": "2022-04-23T00:46:00.005Z",
          "wordCount": 1618,
          "title": "Unicorn Meat - Review",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgYAzxcGnXHDtETA-LJUNKPZD6B9tCclNsmzGTMdEMPRXieZ5prea6HPBCnRiy2C-XQHYRAJ7gIxGcJOkHb31njQgHC9_b5NPMG0LHjFOE4LfiOag4s8fUi-T4Ytydj7K1mEqzZOGi0SrogzO-RyVYPnI4qqoUA1pplS_FSEA_a_HvTwzekNVndKCSUGQ/w1200-h630-p-k-no-nu/Screen%20Shot%202022-04-23%20at%208.02.50%20AM.png"
        },
        {
          "id": "https://thecosmicorrery.blogspot.com/2022/04/130-weird-treasures-from-across-spheres.html",
          "author": null,
          "description": "An emperor's tea set that transforms into porcelain swans\nArachnid woven tapestry, bulky, but eye-wateringly sublime\nStack of golden arm rings forged from the war trophies of conquering lord\nElegant carriage dubbed the silver phantom, it once propelled itself but no longer\nA river spirit trapped within a jeweled goblet, water cannot touch you\nTwin rings of beetle-esq design, whisper a message to it and it will fly away to find its partner\nPowdered quadracorn horn from the farthest burning savannas, cures impotency\nImmaculate suit of bone armour, parasitically fuels itself off the weavers lifeblood\nPackages of excellent, smooth, fine smelling soap\nGem studded broad-belt of office stolen from some petty prince\nSkeleton warrior seeds, in neat little pouch\nCultiver of a rare singing orchid, it…",
          "link": "https://thecosmicorrery.blogspot.com/2022/04/130-weird-treasures-from-across-spheres.html",
          "publishedOn": "2022-04-11T13:35:00.001Z",
          "wordCount": 2010,
          "title": "130 Weird Treasures From Across The Spheres",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiqmWdEqWpX77aGLgjx-5lvX6QYE1-H8gu9D3XYqMB7K4Rce4hhwCC0duP6-DBMau82YgzZ3t5OB0EA_1EoFQdoER-lxAEcQfy6E4cKrcIWFzWmLkPrflS-Mfu6TUFAyF3kpHSv1qmQmFe7tS3pEtIzs0FY4F-2-qH4CmqNGB7eN5ejfTuC2NYwBUZ_gQ/w1200-h630-p-k-no-nu/17th-cup-252carat-pure-emerald-emproerjehangir-mughal.jpeg"
        }
      ]
    },
    {
      "title": "Githyanki Diaspora",
      "feedUrl": "https://githyankidiaspora.com/feed/",
      "siteUrl": "https://githyankidiaspora.com",
      "articles": [
        {
          "id": "http://githyankidiaspora.com/?p=19327",
          "author": "juddthelibrarian",
          "description": "More folk for your Treasure-hunters, Barrow-delvers and Tomb-thieves to hire when they need more hands on deck. In case this first lot wasn't enough.",
          "link": "https://githyankidiaspora.com/2022/05/03/hirelings-2-the-creepy-lot/",
          "publishedOn": "2022-05-03T04:08:23.000Z",
          "wordCount": 522,
          "title": "Hirelings 2: The Creepy Lot",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/05/hirelings-the-herd.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19309",
          "author": "juddthelibrarian",
          "description": "For as long as I’m giving this pay-to-play thing a go, I’ll be posting what I’m running in the coming week Sunday night/Monday morning. These will be clearly labelled, so if this kind of thing vexes you, it is easily ignorable. For my first two pay-to-play games I chose two games right in my wheelhouse […]",
          "link": "https://githyankidiaspora.com/2022/05/02/this-weeks-pay-games/",
          "publishedOn": "2022-05-02T06:50:39.000Z",
          "wordCount": 652,
          "title": "This Week’s Pay Games",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/05/trophy-gold-twitter-pic-stag.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19265",
          "author": "juddthelibrarian",
          "description": "In which originality in one's RPG campaign design is discussed.\n\ntl;dr Fuck originality.\n\nOP\nSo I'm working on some history for my world and I get this great idea. My players are finding these objects of unidentifiable ancient magic, and I wasn't sure what they were for yet. Then I thought well they're solving these draconic riddles to reach the objects, maybe they're like seals placed a thousand years ago by a dragon cult to seal evil dragons away in the earth! Cool! Dammit, that's basically Skyrim. Still doing it.\n\nWhat do you do when you realize your idea is too close to a book/movie/game? Roll with it? Scrap it?\n\nResponse:\n\n\n\n\nFuck originality.\n\nIt will become original through the amazingly imaginative things your friends do in response to it all and the game and your decisions in the moment as the dice add their element.\n\nDon't sweat it. Unleash your friends on it.",
          "link": "https://githyankidiaspora.com/2022/05/01/dms-academy-question-about-originality/",
          "publishedOn": "2022-05-01T19:49:54.000Z",
          "wordCount": 964,
          "title": "DM’s Academy question about originality",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/originality-reddit.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19277",
          "author": "juddthelibrarian",
          "description": "I’m giving paid GMing a try on the Start Playing site. Please click here if you have gamed with me and you’d like to leave a review of my GMing. Click here if you’d like to see what games I have coming up or if you’d like to register for a paid game. Right now […]",
          "link": "https://githyankidiaspora.com/2022/04/30/try-professional-gming-sure/",
          "publishedOn": "2022-05-01T01:27:55.000Z",
          "wordCount": 493,
          "title": "Try Professional GMing? Sure.",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2021/12/wodu-subject-divider.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19168",
          "author": "juddthelibrarian",
          "description": "In this session of the table-top role-playing game, Trophy Gold...creepy doll constructs with a silver bell for a hand, a child-blob and the looming threat of the pit...",
          "link": "https://githyankidiaspora.com/2022/04/29/3-out-from-the-roots-trophy-gold-roots-of-old-kalduhr/",
          "publishedOn": "2022-04-29T20:57:44.000Z",
          "wordCount": 1697,
          "title": "3 – Out from the Roots, Trophy Gold: Roots of Old Kalduhr",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/roots-of-old-kalduhr-twitter-pic-1.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19179",
          "author": "juddthelibrarian",
          "description": "In tonight's Thursday night Dungeons and Dragons game...blood is spilled at a spirited Doors of Fate table and Kuru disappears with an Aboleth.",
          "link": "https://githyankidiaspora.com/2022/04/28/all-shadows-lead-to-gloomwrought-session-11-the-execution-of-the-drow-job/",
          "publishedOn": "2022-04-29T03:08:20.000Z",
          "wordCount": 1143,
          "title": "All Shadows Lead to Gloomwrought, Session 11, The Execution of the Drow Job",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/all-shadows-lead-to-gloomwrought-twitter-pic-s11-the-execution-of-the-drow-job.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19070",
          "author": "juddthelibrarian",
          "description": "In this session of the table-top role-playing game, Trophy Gold...the Treasure-Hunters delve into the Roots of Old Kalduhr.",
          "link": "https://githyankidiaspora.com/2022/04/22/2-down-trophy-gold-roots-of-old-kalduhr/",
          "publishedOn": "2022-04-22T19:53:21.000Z",
          "wordCount": 1286,
          "title": "2 – Down, Trophy Gold: Roots of Old Kalduhr",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/roots-of-old-kalduhr-twitter-pic-2.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19143",
          "author": "juddthelibrarian",
          "description": "Third Floor Wars interviews Karen Twelves and Sean Nittner.\n\nAdventure Design with Bryce Lynch from Ten Foot Pole.\n\nWhat makes a great adventure? on Questining Beast",
          "link": "https://githyankidiaspora.com/2022/04/19/what-am-i-listening-to-on-april-19-2022/",
          "publishedOn": "2022-04-19T18:56:47.000Z",
          "wordCount": 468,
          "title": "What am I listening to on April 19, 2022?",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/thired-floor-wars.jpg"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19079",
          "author": "juddthelibrarian",
          "description": "Hirelings for Trophy Gold, Dungeons & Dragons or whatever tabletop role-playing game you use as your medium for delving into demon-haunted ruins with your friends.",
          "link": "https://githyankidiaspora.com/2022/04/18/hirelings/",
          "publishedOn": "2022-04-18T12:39:30.000Z",
          "wordCount": 977,
          "title": "Hirelings",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/hirelings-chatwyn-and-sprunt-2.png?w=1200"
        },
        {
          "id": "http://githyankidiaspora.com/?p=19009",
          "author": "juddthelibrarian",
          "description": "In which the treasure-hunters venture into the ancient Deep Kalduhr in order to find treasure...",
          "link": "https://githyankidiaspora.com/2022/04/15/1-into-the-forest-trophy-gold-the-roots-of-old-kalduhr/",
          "publishedOn": "2022-04-15T20:42:10.000Z",
          "wordCount": 1256,
          "title": "1 – Into the Forest, Trophy Gold: The Roots of Old Kalduhr",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/roots-of-old-kalduhr-twitter-pic-1.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=18997",
          "author": "juddthelibrarian",
          "description": "In tonight's Thursday night Dungeons and Dragons game...Kuru finds trouble in a Drow kitchen and the Sigil 6 prepares for the job.",
          "link": "https://githyankidiaspora.com/2022/04/14/all-shadows-lead-to-gloomwrought-session-10-the-drow-job-prep/",
          "publishedOn": "2022-04-15T03:18:24.000Z",
          "wordCount": 848,
          "title": "All Shadows Lead to Gloomwrought, Session 10, The Drow Job Prep",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/all-shadows-lead-to-gloomwrought-twitter-pic-s10-drow-job-prep.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=18152",
          "author": "juddthelibrarian",
          "description": "In which the game ends before the adventure is finished…? WTF? We all like Mothership, each other’s contributions and were digging the adventure but due to personal issues all around, we had nearly a month between games. This adventure is intense; it is a thinker or as Judd called it, “a cerebral xeno-temple crawl.” It […]",
          "link": "https://githyankidiaspora.com/2022/04/08/sometimes-the-rockets-launch-and-sometimes-they-dont/",
          "publishedOn": "2022-04-09T00:48:20.000Z",
          "wordCount": 610,
          "title": "Sometimes the rockets launch and sometimes they don’t.",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/02/mothership-alien-gods-twitter-pic-sessionless-title-card.png"
        },
        {
          "id": "http://githyankidiaspora.com/?p=18937",
          "author": "juddthelibrarian",
          "description": "In tonight's Thursday night Dungeons and Dragons game...the Sigil 6 agrees to do a bloody chore for a Drow Matron for use of the Old Githyanki Gate that her House currently controls.",
          "link": "https://githyankidiaspora.com/2022/04/07/all-shadows-lead-to-gloomwrought-session-9-the-old-githyanki-gate/",
          "publishedOn": "2022-04-08T02:49:14.000Z",
          "wordCount": 1872,
          "title": "All Shadows Lead to Gloomwrought, Session 9, The Old Githyanki Gate",
          "imageUrl": "https://githyankidiaspora.files.wordpress.com/2022/04/all-shadows-lead-to-gloomwrought-twitter-pic-s9-the-old-githyanki-gate.png"
        }
      ]
    },
    {
      "title": "Glass Bird Games",
      "feedUrl": "https://glassbirdgames.blogspot.com/feeds/posts/default",
      "siteUrl": "https://glassbirdgames.blogspot.com/",
      "articles": []
    },
    {
      "title": "All Dead Generations",
      "feedUrl": "https://alldeadgenerations.blogspot.com/feeds/posts/default",
      "siteUrl": "https://alldeadgenerations.blogspot.com/",
      "articles": []
    },
    {
      "title": "Dungeon of Signs",
      "feedUrl": "https://dungeonofsigns.blogspot.com/feeds/posts/default",
      "siteUrl": "https://dungeonofsigns.blogspot.com/",
      "articles": []
    },
    {
      "title": "d66 Classless Kobolds",
      "feedUrl": "https://d66kobolds.blogspot.com/feeds/posts/default",
      "siteUrl": "https://d66kobolds.blogspot.com/",
      "articles": [
        {
          "id": "https://d66kobolds.blogspot.com/2022/04/three-statlines-for-all-npcs.html",
          "author": null,
          "description": "Jack made it clear that you can just use bears. \nI utilize this all the time in general handwave fashion, but when I specifically run Into the Odd/Weird North/Cairn/Monolith etc, I've landed on a three-tier measure of NPC power so as to better represent varying tactical levels of possible encounters. It's not rocket science, and it's not perfect, but it's what I do and it's been nigh-on effortless for me for years now. \nThere are three NPC statlines, and that's it. Ever.\n\n\nObligatory image because blogpost. Also because Stepan Alekseev. Artstation.\n\n\n[1] = mundane power level NPCs: villagers, skellingtons, imps, coyotes, hired guns.\n[2] = impressive power level NPCs: knights, trolls, velociraptors, actual bears, commandos.\n[3] = boss power level NPCs: liches, hell pigs, dragons, t-rexes, p…",
          "link": "https://d66kobolds.blogspot.com/2022/04/three-statlines-for-all-npcs.html",
          "publishedOn": "2022-04-29T13:18:00.001Z",
          "wordCount": 1148,
          "title": "Three Statlines for All NPCs",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgGBBOx7fZckrwX5xAmMEpOVhhNP2_MPzqsFCEkgnY0V7bM3Zypnx-v4_puifh6ypUjQxFRxaZawbSmfao5sYMX0DkoElaSqyiK4p1ltuJaGIxDI752aw8wQ5JAyZiSlWI9ty_1uPgn0Eo7dHlhDK0AmoFb6YvuJsCceZ_V1cYySljudOBn9GgHcEJmWw/w1200-h630-p-k-no-nu/stepan-alekseev-02s.jpg"
        },
        {
          "id": "https://d66kobolds.blogspot.com/2022/04/star-wars-faction-write-up-inspired-by.html",
          "author": null,
          "description": "Mood Music\n\nThis, right here, is one of my all-time favorite board games, packed so full of chrome and drama that you can rewrite the Original Trilogy with a single play. This is not a post, however, about the board game, nor the similarly-styled and eponymous computer strategy game which came before it. This post is about how my friends and I played this video-game-turned-board-game in order to inspire the setting for our tabletop adventure game campaign. Layers. \nThe same new Galaxy Far Away campaign which I mentioned last time (including the example of real play therein) came about when I pitched \"Star Wars D&D\" to some guys I mentor on a regular basis. Both of them have played Rebellion against me many times, so one of them said \"hey, what if we play again and whatever the outcome of t…",
          "link": "https://d66kobolds.blogspot.com/2022/04/star-wars-faction-write-up-inspired-by.html",
          "publishedOn": "2022-04-23T15:18:00.003Z",
          "wordCount": 2682,
          "title": "Star Wars Faction Write-Up, Inspired by a Board Game",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh2JxICsLMJpJd0BT3d1oRduil_ulShQNdL3VOm3I69qGqXpml5Cjx6iewMuT7sp2KhtLfNO3V_jhQSVsb1Pe6KKsNKxapSfNYfOdOHO72hOsH42klJWfHWqv8KWqk_j6S2XX90TZXXS0JEZW4ptoRwmodh1GE6oiUOpA2ow3MvG3c2PKI7WkLoxgPkmA/w1200-h630-p-k-no-nu/star-wars-rebellion-box.jpg"
        },
        {
          "id": "https://d66kobolds.blogspot.com/2022/04/fantasy-flight-dice-with-galaxy-far.html",
          "author": null,
          "description": "For as often as I run my games diceless (or nearly so), I do really enjoy dice. I promise. \nI started up a new local Galaxy Far Away campaign just over a week ago, and I realized I did not take a liking to the standard opposed 2d6 resolution that I originally penned for the game. Maybe it's because using d6 in Star Wars should belong with West End Games' timeless take on the genre, or maybe because I tend to find traditional opposed resolution less and less compelling these days. \nI have grown stale on finding out if something happens or not. Instead, stuff always happens. The question is not \"does it happen?\" but \"how?\" and I'm finding that said qualitative result generation is much more interesting than pass/fail. I'm not reinventing the wheel here, as the whole \"yes, and\" or \"yes, but\" …",
          "link": "https://d66kobolds.blogspot.com/2022/04/fantasy-flight-dice-with-galaxy-far.html",
          "publishedOn": "2022-04-15T19:22:00.004Z",
          "wordCount": 2410,
          "title": "Fantasy Flight Dice with Galaxy Far Away (and other thoughts)",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiG4xW7YB5MfQBvLbU5vqcwa7Yzk8KIbF3uxvl8xgGrOXvbIBRJoByrvDQKbCjoqqcACKQ4Biq84PZsUbkL_V7oRy9Bxh2PjIGqSiy-jyPOFQBE9msbWY0LWmbteMhqRyVtm7ppWdZiqop_8uvCv2QsX3rt4gx3mnhumm9BEuxtVUFQFZykR_3mJ2EGkA/w1200-h630-p-k-no-nu/download.jpg"
        },
        {
          "id": "https://d66kobolds.blogspot.com/2022/04/d6-no-hands-character-concepts.html",
          "author": null,
          "description": "It's that time again--secret jackalope! Magos of the Mind#1349 wants \"Beyond Humanoid: or guidance for playing something without hands I guess. Can be something like the \"Really Good Dog\"* glog class or something more original/alien.\"\nWe take it for granted that we have two average human hands. You can eat a sandwich, fold your clothes, and stare at your smartphone for much more time than is necessary with typical hands. Take those away, and you get all sorts of curious different conceptions of everyday ambulation and motor control. \nSo what do you do without hands? Are you like Zacian, from Generation VIII Pokemon, who is a superpowered dog that holds a straight-up legendary sword in its mouth? That is, admittedly, quite rad.\n\n\n\n\n1. You have four legs but your mouth and jaws are very stro…",
          "link": "https://d66kobolds.blogspot.com/2022/04/d6-no-hands-character-concepts.html",
          "publishedOn": "2022-04-11T15:12:00.005Z",
          "wordCount": 931,
          "title": "d6 No-Hands Character Concepts",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgEDnsN6aojcXPLMYS_RXcNPVeb1kU_qznqFkv-pGMFXo7M5mLbziV1OtAOOmgpzKlNMcIsg4GFEk60mYuxw0hUVxJ-Fq48JEYSbwNmGy3rT0jqioRMtgrha1zaWnPsKAL4c4FW0IktRJVTZCXLb3E7h6yhKQvSIL8k5cIgZCPYcuMohQMeabSeo0PQDQ/w1200-h630-p-k-no-nu/Zacian%20by%20tomycase.jpg"
        }
      ]
    },
    {
      "title": "hypertext corner",
      "feedUrl": "https://www.hypertextcorner.com/feed.rss",
      "siteUrl": "https://www.hypertextcorner.com",
      "articles": [
        {
          "id": "https://www.hypertextcorner.com/micetown",
          "author": "townbuilding for Mausritter",
          "description": "Modified concept art for Mouse Guard by Darek Zabrocki\n\nSo your mice have suddenly come to power in a local settlement? Have they been granted rule by a noblemice? Have organised a clever coup? Well, now they have new problems of managing a township. This post is written to guide you through this tricky process.\ntownship turn\nWhen mice perform town managing duties, time is divided into township turns, which last about a week. At the start of each township turn, roll a district die which will inform what happens on that turn.\nRoll\nEffect\nDescription\n\n\n\n\n1\nEncounter\nNew characters arrive to the settlement. A merchant caravan, an attack by evil cats, or humans start meddling with the tree you dwell under.\n\n\n2\nRuin\nBuildings and structures age and/or get damaged.\n\n\n3\nWeather\nRoll for weather (…",
          "link": "https://www.hypertextcorner.com/micetown",
          "publishedOn": "2022-04-13T14:00:00.000Z",
          "wordCount": 1323,
          "title": "townbuilding for Mausritter",
          "imageUrl": "https://blotcdn.com/blog_c2d7d44286f94275ae5776f0305d1514/_thumbnails/dfbc8d5f-2130-4912-81c4-c6515f07d2ac/large.png"
        }
      ]
    },
    {
      "title": "Deeper Into The Dungeon",
      "feedUrl": "https://deeperintothedungeon.wordpress.com/feed/",
      "siteUrl": "https://deeperintothedungeon.wordpress.com",
      "articles": [
        {
          "id": "http://deeperintothedungeon.wordpress.com/?p=2595",
          "author": "LordPersi",
          "description": "I have been prepping and running a sandbox open table of Whitehack 3e. (I will write my thoughts on Whitehack one day in a post.) The characters usually begin the session in a base camp, and they choose where to venture. A classic experience, nothing special. But I have chosen a small map of 3×4 … Continue reading Pointcrawls and Tight-Packed Sandboxes",
          "link": "https://deeperintothedungeon.wordpress.com/2022/04/27/pointcrawls-and-tight-packed-sandboxes/",
          "publishedOn": "2022-04-26T23:02:31.000Z",
          "wordCount": 3327,
          "title": "Pointcrawls and Tight-Packed Sandboxes",
          "imageUrl": "https://deeperintothedungeon.files.wordpress.com/2022/04/cairn_frost_elves_forest_map.png"
        }
      ]
    }
  ],
  "cliVersion": "1.14.4"
}